### 판다스를 활용한 데이터 이해

In [3]:
myfood = ['banana', 'apple', 'candy']
print(myfood[0])
print(myfood[1])
print(myfood[2])

banana
apple
candy

In [4]:
print(myfood[1:3])   # 두번째(1)부터 세번째(2)까지 가져오기

['apple', 'candy']

In [2]:
for item in myfood:
    print(item)

banana
apple
candy

In [15]:
myhobby = ['movie','music','food','sleep']

yourhobby = input('너의 취미는 : ')
for item in myhobby:
    if yourhobby in item:
        print('우리는 똑같은 취미를 가지고 있다')
else:
    print('우리는 다른 취미를 가지고 있다')

너의 취미는 : a
우리는 다른 취미를 가지고 있다

### 딕셔너리(Dictionary)

In [16]:
dict1 = {'one':'하나', 'two':"둘", 'three':'셋'}
dict2 = {1:"하나", 2:"둘", 3:"셋"}
dict3 = {'col1':[1,2,3], 'col2':['a','b','c']}

In [17]:
print(dict1)
print(dict2)
print(dict3)

{'one': '하나', 'two': '둘', 'three': '셋'}
{1: '하나', 2: '둘', 3: '셋'}
{'col1': [1, 2, 3], 'col2': ['a', 'b', 'c']}

In [18]:
print(dict1['one'])
print(dict2[2])
print(dict3['col2'])

하나
둘
['a', 'b', 'c']

### 판다스 모듈 불러오기

In [20]:
import pandas as pd
from pandas import Series, DataFrame

In [21]:
print("pandas 버전 : ", pd.__version__)

pandas 버전 :  0.23.4

홍길동 팀별 대항 게임 5일간의 점수

In [22]:
score = Series( [1000,14000, 3000, 3000, 1000] )
print(score)

0     1000
1    14000
2     3000
3     3000
4     1000
dtype: int64

In [23]:
print("자료형 확인 : ", type(score))

자료형 확인 :  <class 'pandas.core.series.Series'>

In [24]:
print("Series 인덱스 확인 : ", score.index)

Series 인덱스 확인 :  RangeIndex(start=0, stop=5, step=1)

In [26]:
print("Series 값 확인 : ", score.values)

Series 값 확인 :  [ 1000 14000  3000  3000  1000]

In [27]:
# 판다스 시리즈 인덱스 지정
score = Series( [1000, 14000, 3000], 
                index=['2019-05-01', '2019-05-02', '2019-05-03'])
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [28]:
print(score['2019-05-01']) # 인덱스 이용 - 5월 1일 날짜 점수 확인
print("-------------")
print(score['2019-05-02':'2019-05-03']) # 5월 2일, 3일 날짜 팀 점수 확인

1000
-------------
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [29]:
for idx in score.index:
    print(idx)

2019-05-01
2019-05-02
2019-05-03

In [30]:
for value in score.values:
    print(value)

1000
14000
3000

gildong, toto의 값들 중 2500 이상인 것의 갯수 구하기

In [31]:
# 길동팀의 3일간의 점수와 toto 팀의 3일간의 점수
gildong = Series([1500, 3000, 2500],
   index = ['2019-05-01', '2019-05-02', '2019-05-03'] )
toto = Series([3000, 3000, 2000],
   index = ['2019-05-01', '2019-05-03', '2019-05-02'] )

In [33]:
count = 0
for value in gildong.values:
    if value >= 2500:
        count = count+1
for value in toto.values:
    if value >= 2500:
        count = count+1        
print('2500 이상의 데이터 갯수는 최종적으로 : ', count)

2500 이상의 데이터 갯수는 최종적으로 :  4

### 데이터 프레임의 이해

* 데이터 프레임의 객체를 생성하는 가장 간단한 방법은 딕셔너리를 이용하는 방법
* 데이터 프레임은 Series의 결합으로 이루어진 것으로 생각할 수 있음.
* Pandas(판다스)의 대표적인 기본 자료형이다.
* DataFrame 함수를 이용하여 객체 생성이 가능하다.

In [35]:
dat = { 'col1' : [1,2,3,4],
        'col2' : [10,20,30,40],
        'col3' : ['A','B','C','D']}
df = DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

네 팀의 5일간의 팀별 점수
* 팀은 toto, gildong, apple, catanddog 팀이다.

In [36]:
from pandas import DataFrame
team_score = {  "toto":[1500,3000,5000,7000,5500],
                "apple":[4000,5000,6000,5500,4500],
                "gildong":[2000,2500,3000,4000,3000],
                "catanddog":[7000,5000,3000,5000,4000]}
team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [37]:
date = ['19-05-01','19-05-02', '19-05-03', '19-05-04', '19-05-05']
team_df = DataFrame(team_score,
    columns=['catanddog', 'toto', 'apple', 'gildong'],
    index=date)
team_df

          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
19-05-04       5000  7000   5500     4000
19-05-05       4000  5500   4500     3000

In [38]:
team_df['toto']

19-05-01    1500
19-05-02    3000
19-05-03    5000
19-05-04    7000
19-05-05    5500
Name: toto, dtype: int64

In [39]:
team_df[['toto','gildong']]

          toto  gildong
19-05-01  1500     2000
19-05-02  3000     2500
19-05-03  5000     3000
19-05-04  7000     4000
19-05-05  5500     3000